Revit 2026 API

# FamilyInstanceMEPModel Property

---

Retrieves the MEP model for the family instance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public MEPModel MEPModel { get; }
```
```vb
Public ReadOnly Property MEPModel As MEPModel
	Get
```
```cpp
public:
property MEPModel^ MEPModel {
	MEPModel^ get ();
}
```
```fsharp
member MEPModel : MEPModel with get
```

#### Property Value

MEPModel

If the family instance has a MEP model it is returned by this method, otherwise  is returned. Different types of MEP model will be returned based on the type of the instance, for example - if the instance is a lighting device then a lighting device model will be returned. This property will only function with the Autodesk Revit MEP product.

#### Reference

FamilyInstance Class

Autodesk.Revit.DB Namespace